public class Main {

   /**Интернет магазин, часть 1**
    Создать класс Товар, имеющий переменные имя, цена, рейтинг.
    Создать класс Категория, имеющий переменные имя и массив товаров.
    Создать несколько объектов класса Категория.
    Создать класс Basket, содержащий массив купленных товаров.
    Создать класс User, содержащий логин, пароль и объект класса Basket.
    Создать несколько объектов класса User.
    Вывести на консоль каталог продуктов.
    Вывести на консоль покупки посетителей магазина.*/

    public static void main(String[] args) {
        System.out.println(" Wir machen einen digitalen Laden auf! v 0.1");


    }
}